# ExportLinetypeInfo Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeInfo Constructor
ExportLinetypeInfo Class See Also
---
Constructs a new default ExportLinetypeInfo.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportLinetypeInfo()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExportLinetypeInfo()
```

# See Also
ExportLinetypeInfo Class
ExportLinetypeInfo Overload
Autodesk.Revit.DB Namespace